In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__, np.__version__

('1.0.3', '1.18.2')

In [3]:
# needs two steps
# one to assign the dataframe to a variable
df = pd.DataFrame({
    'name':['john','david','anna'],
    'country':['USA','UK',np.nan]
})
df

    name country
0   john     USA
1  david      UK
2   anna     NaN

In [4]:
# another one to perform the filter
df[df['country']=='USA']

   name country
0  john     USA

In [5]:
pd.DataFrame({
    'name':['john','david','anna'],
    'country':['USA','UK',np.nan]
}).query("country == 'USA'")

   name country
0  john     USA

## query where is null

In [ ]:
df = pd.DataFrame({
    'name':['john','david','anna'],
    'country':['USA','UK',np.nan]
})

df.query('country.isnull()')

## query with python variable

In [6]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name':['john','david','anna'],
    'country':['USA','UK',np.nan],
    'age':[23,45,45]
})

target_age = 45

df.query('age == @target_age')

    name country  age
1  david      UK   45
2   anna     NaN   45

## OR operator

In [20]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name':['john','david','anna'],
    'country':['USA','UK', 'USA'],
    'age':[23,45,45]
})
df

    name country  age
0   john     USA   23
1  david      UK   45
2   anna     USA   45

In [23]:
df.query("(name=='john') or (country=='UK')")

    name country  age
0   john     USA   23
1  david      UK   45

## AND operator

In [24]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name':['john','david','anna'],
    'country':['USA','UK', 'USA'],
    'age':[23,45,45]
})
df

    name country  age
0   john     USA   23
1  david      UK   45
2   anna     USA   45

In [25]:
df.query("(country=='USA') and (age==23)")

   name country  age
0  john     USA   23

## Column is in array

In [26]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name':['john','david','anna'],
    'country':['USA','UK', 'USA'],
    'age':[23,45,45]
})
df

    name country  age
0   john     USA   23
1  david      UK   45
2   anna     USA   45

In [28]:
names_array = ['john','anna']

df.query(f'name in (${names_array})')

SyntaxError: Python keyword not valid identifier in numexpr query (<unknown>, line 1)

## Column name with spaces

## Where column is null

In [9]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name':['john','david','anna'],
    'country':['USA','UK',np.nan]
})

df

    name country
0   john     USA
1  david      UK
2   anna     NaN

In [10]:
df.query('country.isnull()')

   name country
2  anna     NaN

## Where column is not null

In [11]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name':['john','david','anna'],
    'country':['USA','UK',np.nan]
})

df

    name country
0   john     USA
1  david      UK
2   anna     NaN

In [12]:
df.query('country.notnull()')

    name country
0   john     USA
1  david      UK